{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embedding0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"factor_type\": \"avg\", \"magnitude\": 3}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(6375, 20)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "embedding0_fwd", 
      "attrs": {
        "dtype": "float32", 
        "input_dim": "6375", 
        "output_dim": "20", 
        "sparse_grad": "False"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "embedding1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"one\", {}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(6375, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "embedding1_fwd", 
      "attrs": {
        "dtype": "float32", 
        "input_dim": "6375", 
        "output_dim": "1", 
        "sparse_grad": "False"
      }, 
      "inputs": [[0, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "_linalg_gemm2", 
      "name": "net0_linalg_gemm20", 
      "attrs": {"transpose_a": "True"}, 
      "inputs": [[2, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten0_flatten0", 
      "inputs": [[5, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 1, 3], 
  "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7], 
  "heads": [[6, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10901]}
}